florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
// ---- Shifter gear tracking ----
static uint8_t  lastSentGear      = 0xFF;    // last gear value sent to STM32
static unsigned long lastGearSendMs = 0;     // debounce for gear CAN sends
static constexpr unsigned long GEAR_SEND_DEBOUNCE_MS = 100;
static constexpr uint8_t GEAR_REVERSE = 1;   // shifter raw value for Reverse

// ---- Mode state tracking ----
// §1 Separación global real: the driver's INTENT and the STM32-CONFIRMED state
// are kept strictly apart (they used to share one ambiguous currentModeFlags).
//   - desiredModeFlags : current driver intent, arbitrated from the physical
//                        selector, remote or tank-turn toggle.  Fed into the
//                        sync FSM via g_modeSync.setDesired() ONLY.
//   - appliedModeFlags : mode CONFIRMED exclusively by the STM32 heartbeat echo
//                        (the SOLE writer is the heartbeat-sync block).  The HMI
//                        icon shows this, never the mere request.
//   - localTankTurn    : the local (HMI) tank-turn toggle state, an input to the
//                        LOCAL branch of the authority arbitration.
static uint8_t  desiredModeFlags  = 0;       // Driver intent (bit0=4x4, bit1=tank)
static uint8_t  appliedModeFlags  = 0;       // STM32-confirmed mode (heartbeat)
static bool     localTankTurn     = false;   // Local tank-turn toggle (desired)

// ---- Drive-mode sync FSM (physical 4x4 selector = source of truth) ----
// The debounced selector latches its state into g_modeSync.setDesired(); the
// FSM defers the actual CMD_MODE transmission until the STM32 heartbeat is
// confirmed and (re)transmits until an ACK arrives or a bounded retry budget
// is exhausted.  Logic lives in the pure, host-tested mode_sync.h.
static constexpr uint8_t MODE_SYNC_MAX_RETRIES = 3;
static ModeSync      g_modeSync(can::ACK_TIMEOUT_MS, MODE_SYNC_MAX_RETRIES);
static unsigned long g_modeSendMs   = 0;     // millis() of last FSM-driven send
static unsigned long g_lastModeAckTs = 0;    // last CMD_MODE ACK consumed by FSM
static unsigned long g_lastModeEchoTs = 0;   // last heartbeat frame fed as mode echo

// ---- Power/Audio state tracking ----
static bool     welcomePlayed     = false;
static bool     farewellPlayed    = false;
static uint8_t  lastAppliedAudioVolume = 15;
static unsigned long lastRemoteVolumeSetMs = 0;
static constexpr unsigned long REMOTE_VOLUME_DEBOUNCE_MS = 250;
static constexpr uint8_t       REMOTE_VOLUME_HYSTERESIS  = 2;
// Brownout/reboot guard: minimum interval between WELCOME sounds.
// On rapid MCU resets (brownout, watchdog) the ESP32 may restart
// multiple times in quick succession.  This timestamp prevents audio
// spam by enforcing a cooldown.  NOTE: static RAM is NOT guaranteed
// to persist across all reset types on all ESP32 variants.  On a
// full power cycle, lastWelcomePlayMs reinitialises to 0 (desired:
// fresh boot always plays welcome).  On brownout or SW reset, the
// per-sound cooldown in audio_manager.cpp (SOUND_COOLDOWN_MS=4s)
// provides a secondary safety net even if this variable is lost.
static unsigned long lastWelcomePlayMs = 0;
static constexpr unsigned long WELCOME_COOLDOWN_MS = 5000;  // 5 s minimum gap

// ---- Runtime overlay state ----
static bool     showOverlay       = true;    // overlay visible on initial screen only
static uint32_t lastFrameStart    = 0;

// ---- Render heartbeat (audit P2) ----
// Monotonic millis() timestamp published by renderTask at the END of every
// fully completed frame, i.e. AFTER screenManager.update(), all TFT drawing,
// the centralized touch read, and the implicit release of the shared SPI bus.
// Core-1 (loop) reads this to feed the DisplaySupervisor; the heartbeat only
// advances when a frame truly finished, so a hung render/SPI transaction is
// observable as a stalled timestamp.  volatile: written on Core 0, read on
// Core 1 (a single aligned 32-bit word — atomic on the ESP32-S3).
static volatile uint32_t renderHeartbeatMs = 0;
static volatile uint32_t renderFrameCounter = 0;

// ---- Core-1 → Core-0 TFT recovery request (audit P2 §4) ----
// The white-screen fault must be recovered with EXCLUSIVE bus ownership from
// the Core-0 render task; Core 1 must NEVER call TFT_eSPI.  Core 1 (loop /
// supervisor) only posts a request into this mailbox, and Core 0 executes the
// hardware choreography (display_recovery.h) and reports the result back.  The
// pure handshake logic lives in display::RecoveryRequestMailbox (host-tested in
// test_display_recovery.cpp); the portMUX below makes the two-core access safe.
static display::RecoveryRequestMailbox g_recoveryMailbox;
static portMUX_TYPE g_recoveryMux = portMUX_INITIALIZER_UNLOCKED;

// Bench/manual "the panel went white" request (audit §4.2).  Because the white
// screen is NOT automatically observable with the current wiring (no reliable
// readback, no reset-signal latch), an operator/bench path can explicitly
// request a recovery.  Set from Core 1 (serial command / future HMI button).
static volatile bool g_manualRecoveryRequest = false;

// Optional latched TFT reset-signal evidence (audit §4.3).  Remains false
// unless a real hardware latch on TFT_RST/GPIO38 is wired and sets it; the
// firmware never fabricates this signal, so white is never asserted from it
// unless the hardware truly observed a reset.
static volatile bool g_tftResetSignalLatched = false;

// Core-1 entry point to request a recovery.  Thread-safe; posts into the
// mailbox only if none is pending / in flight.  Returns true if accepted.  The
// current time is latched so Core 1 can later detect a render task that never
// consumes the request (audit P2.1).
static bool requestDisplayRecovery(display::RecoveryTrigger trigger) {
    bool accepted;
    taskENTER_CRITICAL(&g_recoveryMux);
    accepted = g_recoveryMailbox.request(trigger, (uint32_t)millis());
    taskEXIT_CRITICAL(&g_recoveryMux);
    return accepted;
}

// ---- Core-1 → Core-0 post-recovery banner text mailbox (audit P2.4) ----
// Core 1 assembles the banner (with REAL supervisor counters) and posts the
// formatted text here; Core 0 (render task) shows it as a ScreenManager overlay
// so a subsequent full redraw cannot erase it.
static portMUX_TYPE g_bannerMux = portMUX_INITIALIZER_UNLOCKED;
static char          g_bannerText[320] = {0};
static volatile bool g_bannerReady = false;

static void postRecoveryBanner(const char* text) {
    taskENTER_CRITICAL(&g_bannerMux);
    strncpy(g_bannerText, text, sizeof(g_bannerText) - 1);
    g_bannerText[sizeof(g_bannerText) - 1] = '\0';
    g_bannerReady = true;
    taskEXIT_CRITICAL(&g_bannerMux);
}

