florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
static bool takeRecoveryBanner(char* out, size_t n) {
    bool have = false;
    taskENTER_CRITICAL(&g_bannerMux);
    if (g_bannerReady) {
        strncpy(out, g_bannerText, n - 1);
        out[n - 1] = '\0';
        g_bannerReady = false;
        have = true;
    }
    taskEXIT_CRITICAL(&g_bannerMux);
    return have;
}

// Audit P2 final — persisted render-blocked reboot surfaced ON THE HMI once.
// setup() (Core 1) reads the persisted cause and, if a reboot is still pending,
// latches it here BEFORE the render task exists.  The render task (Core 0) then
// publishes it as a ScreenManager overlay on its first frames and clears ONLY
// rb_pending, keeping rb_count as the historical counter.  Written once by
// Core 1 before task creation (happens-before), then owned by Core 0.
static volatile bool             s_rebootBannerPending = false;
static display::RebootRecoveryInfo s_rebootBannerInfo   = {};

// Clear ONLY the rb_pending flag after the banner has been published, keeping
// rb_cause / rb_uptime / rb_count intact as the historical record so later
// normal boots do NOT repeat the banner.
static void clearRenderBlockedPending(void) {
    Preferences p;
    if (p.begin("disp_fault", /*readOnly=*/false)) {
        p.putBool("rb_pending", false);
        p.end();
    }
}

// Audit P2.1 — last resort when the render task is genuinely blocked and never
// consumes/finishes the recovery request.  Core 1 persists the cause to NVS and
// performs a controlled ESP32 restart.  Core 1 NEVER touches the TFT/SPI here.
static void persistRenderBlockedAndReboot(display::RecoveryTrigger trigger) {
    Preferences p;
    if (p.begin("disp_fault", /*readOnly=*/false)) {
        p.putUChar("rb_cause",  (uint8_t)trigger);
        p.putUInt ("rb_uptime", (uint32_t)millis());
        p.putUInt ("rb_count",  p.getUInt("rb_count", 0) + 1U);
        // audit P2 final — mark the fault pending so the NEXT boot surfaces it
        // on the HMI (not only on the serial log) exactly once.
        p.putBool ("rb_pending", true);
        p.end();
    }
    Serial.printf("[DISPLAY][RECOVERY] RENDER BLOCKED — persisted cause '%s'; "
                  "controlled ESP32 restart\n",
                  display::recoveryTriggerText(trigger));
    Serial.flush();
    delay(50);
    esp_restart();
}

// ---- Audio event tracking ----
static uint8_t  lastAudioSystemState = 0;     // detect state transitions for error alert
static bool     batteryLowPlayed  = false;     // one-shot for battery warning
static bool     batteryCritPlayed = false;     // one-shot for battery critical
static constexpr uint16_t BATTERY_LOW_THRESHOLD_RAW = 2000;  // 20.00 V in 0.01 V units
static constexpr uint16_t BATTERY_CRIT_THRESHOLD_RAW = 1800; // 18.00 V in 0.01 V units
static unsigned long lastObstacleWarnMs = 0;   // debounce obstacle warning beeps
static constexpr unsigned long OBSTACLE_WARN_INTERVAL_MS = 2000;

// ---- Runtime counter for maintenance tracking ----
static unsigned long lastRuntimeTickMs = 0;
static uint32_t      runtimeAccumMs    = 0;       // partial seconds accumulated in RAM (§2.2)
static constexpr unsigned long RUNTIME_COMMIT_INTERVAL_MS = 60000;  // commit to NVS every 60 s
static bool     maintenanceWarnPlayed = false;

// ---- Temperature audio tracking ----
static bool     tempHighPlayed = false;        // one-shot for temp high warning
static constexpr int8_t TEMP_HIGH_THRESHOLD = 85;  // °C — play alert above this
static constexpr int8_t TEMP_HIGH_HYSTERESIS = 5;  // °C — hysteresis to prevent oscillation

// ---- ABS/TCS audio tracking ----
static uint8_t  lastAbsActive = 0;
static uint8_t  lastTcsActive = 0;

// ---- Overcurrent audio tracking ----
static uint8_t  lastSafetyError = 0;           // last SafetyError code for transition detect

// ---- Lights audio tracking ----
static bool     lastFrontRelayOn  = false;
static bool     lastRearRelayOn   = false;
static bool     lightsAudioInit   = false;     // skip first transition on startup

// ---- Multi-error burst arbitration ----
// When >1 error/warning fires within the burst window, play the highest-severity
// sound instead of collapsing to ERROR_GENERAL (Phase 1 AUDIO_MITIGATION_PLAN).
// Severity order: EMERGENCY > OVERCURRENT > BATTERY_CRITICAL > SENSOR errors > ERROR_GENERAL
static uint8_t  errorBurstCount = 0;
static unsigned long errorBurstStartMs = 0;
static constexpr unsigned long ERROR_BURST_WINDOW_MS = 2000;  // 2 s window
static constexpr uint8_t ERROR_BURST_THRESHOLD = 2;           // >=2 errors = burst
static audio::Sound    burstDominantSound = audio::Sound::ERROR_GENERAL;
static audio::Priority burstDominantPri   = audio::Priority::HI;

/// Burst severity ranking — higher value = more important for the driver.
/// Determines which sound wins when multiple errors fire within the burst window.
static uint8_t burstSeverity(audio::Sound s) {
    switch (s) {
        case audio::Sound::EMERGENCY:            return 6;
        case audio::Sound::OVERCURRENT:          return 5;
        case audio::Sound::BATTERY_CRITICAL:     return 4;
        case audio::Sound::SENSOR_TEMP_ERROR:    return 3;
        case audio::Sound::SENSOR_CURRENT_ERROR: return 3;
        case audio::Sound::SENSOR_SPEED_ERROR:   return 3;
        case audio::Sound::ENCODER_ERROR:        return 3;
        case audio::Sound::TEMP_HIGH:            return 3;
        case audio::Sound::BATTERY_LOW:          return 2;
        case audio::Sound::OBSTACLE_WARN:        return 2;
        case audio::Sound::ERROR_GENERAL:        return 1;
        default:                                 return 0;
    }
}

// ---- LED brake/reverse detection thresholds ----
// Speed sum threshold: 4 wheels × 0.5 km/h × 10 (0.1 km/h units) = 20
static constexpr uint32_t LED_SPEED_SUM_THRESHOLD = 20;
// Traction average below which we consider braking (0–100% scale)
static constexpr uint8_t LED_TRACTION_BRAKING_THRESHOLD = 5;
// Traction average below which we consider regen deceleration (above braking).
// Range: braking < trAvg ≤ regen threshold, with speed > 0.
// This triggers the blue-pulse regen indicator on the rear centre zone.
static constexpr uint8_t LED_TRACTION_REGEN_THRESHOLD = 20;

