florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
// ---- NVS flush interval ----
static unsigned long lastNvsFlushMs = 0;
static constexpr unsigned long NVS_FLUSH_INTERVAL_MS = 10000;  // 10 seconds

// ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
// Detect whether the STM32 alive counter (heartbeat byte 0) is actually
// incrementing.  A frozen STM32 (IWDG not kicking, or timer firing without
// the main loop running) would keep sending the same counter value.
// After STM32_HB_FREEZE_COUNT consecutive identical counter values the ESP32
// considers the STM32 non-responsive and inhibits further motion commands.
static constexpr uint8_t  STM32_HB_FREEZE_COUNT = 5;   // 5 × HEARTBEAT_INTERVAL_MS (see STM32_HB_FREEZE_TIME_MS below)
// Tie the freeze-detection window to the heartbeat period at compile time so
// that changing one constant cannot silently desynchronise the other.
static constexpr uint32_t STM32_HB_FREEZE_TIME_MS =
    (uint32_t)STM32_HB_FREEZE_COUNT * can::HEARTBEAT_INTERVAL_MS;
static_assert(STM32_HB_FREEZE_TIME_MS < can::CAN_LOSS_TIMEOUT_MS,
              "STM32 freeze detection must trigger before CAN-loss timeout");
// Absence timeout: if no NEW heartbeat frame arrives within this window the
// STM32 is treated as not-alive independently of the counter value.  Kept
// below CAN_LOSS_TIMEOUT_MS so the dedicated CAN-loss error screen still wins.
static constexpr uint32_t STM32_HB_ABSENCE_TIMEOUT_MS = STM32_HB_FREEZE_TIME_MS;
static Stm32Liveness stm32Liveness(STM32_HB_FREEZE_COUNT, STM32_HB_ABSENCE_TIMEOUT_MS);
// Rate-limit the "frozen" warning so a stuck STM32 cannot spam Serial.
static unsigned long stm32FrozenWarnLastMs = 0;
static constexpr unsigned long STM32_FROZEN_WARN_INTERVAL_MS = 1000;
static bool     stm32IsAlive         = false;

// ---- Gear re-sync after STM32 restart (SAFETY FIX) ----
// When the STM32 restarts it re-initialises to GEAR_FORWARD regardless of
// what gear the ESP32 (or driver) had selected.  The ESP32 detects the restart
// via the startup_inhibit bit (bit 0 of heartbeat statusFlags) transitioning
// from 0→1, sets a flag, and re-sends the current physical shifter gear as soon
// as the inhibit clears and the STM32 enters ACTIVE state.
static bool     stm32StartupSeen     = false;  // true while startup_inhibit was last 1
static bool     gearResyncPending    = false;  // true = need to re-send gear on ACTIVE
static bool     tempMapResyncPending = false;  // true = need to re-send DS18B20 map after STM32 restart

// ---- Render task (Core 0) — offloads TFT + touch from main loop ----
static SemaphoreHandle_t vdMutex = nullptr;
static vehicle::VehicleData renderVD;  // shared copy for render task
static QueueHandle_t touchActionQueue = nullptr;
// R-3 hardening: capture the render task handle so loop() can query
// its stack high-watermark via uxTaskGetStackHighWaterMark().  Was
// previously discarded (nullptr passed as 6th arg of xTaskCreate*).
static TaskHandle_t renderTaskHandle = nullptr;

enum class TouchAction : uint8_t {
    FRONT_LED_TOGGLE,
    REAR_LED_TOGGLE,
    TANK_MODE_TOGGLE,
};

// ---- Command ACK tracking (Phase 13, audit §Entrega 3-D) ----
// Non-blocking, bounded, INDEPENDENT per-command tracking: several distinct
// commands (CMD_MODE, CMD_LED, SERVICE_CMD, CMD_SENSOR_MAP_TEMP) can be in
// flight at once without one overwriting another.  No automatic retry — each
// entry has an independent bounded timeout only, so there are no infinite
// loops.  See ack_tracker.h / test_ack_tracker.cpp.

static ack::Tracker<8> ackTracker(can::ACK_TIMEOUT_MS);

/// Call before sending a command that expects ACK (CMD_MODE, CMD_LED,
/// SERVICE_CMD, CMD_SENSOR_MAP_TEMP).  Registers an independent pending entry.
__attribute__((unused))
static void ackBeginWait(uint8_t cmdIdLow) {
    if (!ackTracker.begin(cmdIdLow, millis())) {
        // Table full — should never happen with only a handful of command
        // classes, but surface it instead of silently dropping the wait.
        Serial.printf("[ACK] table full, cannot track cmd 0x%02X\n", cmdIdLow);
    }
}

/// Call from loop() after can_rx::poll() to consume newly-arrived ACKs and
/// expire any independently timed-out commands.
static void ackCheck(vehicle::VehicleData& data) {
    // Drain EVERY ACK queued during can_rx::poll() and feed each to the tracker
    // exactly once.  can_rx::poll() can decode several CMD_ACK frames in a
    // single call, so consuming only the last-seen ack_ slot would lose the
    // rest and let their pending commands time out even though the ACK arrived.
    // The FIFO is bounded and holds every received ACK in order (see
    // VehicleData::pushAck / popAck).  No timestamp de-duplication is used, so
    // the very first ACK (millis() == 0) is handled correctly too.
    vehicle::AckData ad;
    while (data.popAck(ad)) {
        if (ackTracker.onAck(ad.cmdIdLow) == ack::MatchResult::MATCHED) {
            if (ad.result != can::AckResult::OK) {
                Serial.printf("[ACK] cmd 0x%02X result=%u state=%u\n",
                              ad.cmdIdLow, static_cast<uint8_t>(ad.result),
                              static_cast<uint8_t>(ad.systemState));
            }
        }
        // Unexpected ACKs (no matching pending entry) are ignored.
    }

    // Expire any commands that never got acknowledged (bounded, no retry).
    unsigned long now = millis();
    for (;;) {
        ack::TimeoutInfo to = ackTracker.drainTimeout(now);
        if (!to.valid) break;
        data.setAckTimeout(now);
        Serial.printf("[ACK] TIMEOUT waiting for cmd 0x%02X\n", to.cmdIdLow);
    }
}

/// Send LED relay command to STM32 via CAN 0x120.
/// @param front  true = turn on front relay, false = turn off
/// @param rear   true = turn on rear relay,  false = turn off
static void sendLedCommand(bool front, bool rear) {
    CanFrame frame = {};
    frame.identifier       = can::CMD_LED;
    frame.extd             = 0;
    frame.data_length_code = 2;
    frame.data[0]          = front ? 1 : 0;
    frame.data[1]          = rear  ? 1 : 0;
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    ackBeginWait(can::CMD_LED & 0xFF);  // Low byte of 0x120 = 0x20
}

