florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
/// Send pre-power-cut safe-state request to STM32 via CAN 0x130.
/// Called once on entry to SHUTTING_DOWN, before the external delay
/// relay physically removes power.  The STM32 reuses existing primitives
/// (Traction_EmergencyStop / Steering_Neutralize / Relay_PowerDown) to
/// force PWM=0, EN=LOW, relays OFF.  No ACK is expected.  If the frame
/// is lost on the bus, behaviour is unchanged — the hardware delay
/// relay still cuts power exactly as before.
static void sendSystemShutdown() {
    CanFrame frame = {};
    frame.identifier       = can::CMD_SYSTEM_SHUTDOWN;
    frame.extd             = 0;
    frame.data_length_code = 0;     // Empty payload (STM32 ignores any byte)
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
}

/// Send gear change command to STM32 via CAN 0x102 (CMD_MODE).
/// @param gear  Gear value (0=P, 1=R, 2=N, 3=D1, 4=D2)
static void sendGearCommand(uint8_t gear) {
    CanFrame frame = {};
    frame.identifier       = can::CMD_MODE;
    frame.extd             = 0;
    frame.data_length_code = 2;
    frame.data[0]          = appliedModeFlags; // STM32-confirmed mode (never
                                               // drives a mode change from the
                                               // gear path — the FSM owns that)
    frame.data[1]          = gear;
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    ackBeginWait(can::CMD_MODE & 0xFF);  // Low byte of 0x102 = 0x02
}

/// Send drive mode command to STM32 via CAN 0x102 (CMD_MODE).
/// @param modeFlags  Mode flags byte (bit 0 = 4x4, bit 1 = tank turn)
static void sendModeCommand(uint8_t modeFlags) {
    CanFrame frame = {};
    frame.identifier       = can::CMD_MODE;
    frame.extd             = 0;
    frame.data_length_code = 2;
    frame.data[0]          = modeFlags;
    frame.data[1]          = shifter::getGearRaw();  // Include current gear
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    ackBeginWait(can::CMD_MODE & 0xFF);
}

// ---------------------------------------------------------------------------
// readTftStatus() — attempt an ST7796 status/ID readback (audit §4.1).
//
// Runs on Core 0 only (owns the SPI bus).  Reads the panel ID (RDDID 0x04) at
// SPI_READ_FREQUENCY via TFT_eSPI.  The ST7796 wiring here is documented as
// having unreliable MISO readback, so this is treated conservatively:
//   - an all-zero / all-ones / clearly implausible response  -> UNSUPPORTED
//     (we refuse to assert a controller state we cannot trust), and
//   - a stable, plausible ID                                  -> VALID.
// It NEVER returns INVALID from a single dubious read, so a flaky MISO can not
// fabricate a "controller lost" event.  If a future panel proves reliable
// readback, INVALID can be returned here to drive TFT_STATUS_LOST.
static display::StatusRead readTftStatus() {
    // RDDID returns 3 ID bytes (manufacturer / version / driver).  index 1..3.
    uint8_t id1 = tft.readcommand8(0x04, 1);
    uint8_t id2 = tft.readcommand8(0x04, 2);
    uint8_t id3 = tft.readcommand8(0x04, 3);
    const uint32_t id = ((uint32_t)id1 << 16) | ((uint32_t)id2 << 8) | id3;
    // 0x000000 and 0xFFFFFF are the classic "bus floating / no MISO" patterns.
    if (id == 0x000000UL || id == 0xFFFFFFUL) {
        return display::StatusRead::UNSUPPORTED;
    }
    return display::StatusRead::VALID;
}

// ---------------------------------------------------------------------------
// executeDisplayRecovery() — the REAL Core-0 TFT recovery choreography.
//
// Runs exclusively inside the render task (Core 0), which is the ONLY task that
// touches the TFT SPI bus, so bus exclusion is inherent — no other task can
// interleave a transaction.  Executes the exact ordered steps proven by
// display_recovery.h / test_display_recovery.cpp.  Returns the TRISTATE result
// (VERIFIED / UNVERIFIED_READBACK_UNSUPPORTED / FAILED); it does NOT draw the
// banner — Core 1 assembles it with real counters and shows it as a
// ScreenManager overlay (audit P2.3/P2.4).
// ---------------------------------------------------------------------------
// Recovery hardware ops (Core 0 only).  These are the REAL implementations of
// the injected display::RecoveryOps callbacks; display::runRecovery() drives
// them in the canonical order with the retry/final-failure policy that
// test_display_recovery.cpp verifies with mocks.
namespace {
struct RecoveryCtx {
    int  tftCs          = 10;
    int  touchCs        = 21;
    int  tftRst         = 38;
    bool status_invalid = false;  // reliable readback (future) reported INVALID
    bool observable     = false;  // whiteScreenObservable() at last verify
};

void rec_stopRenderTouch(void*) { /* we are the sole SPI owner on Core 0 */ }
void rec_blockBus(void*)        { /* bus exclusion is inherent on Core 0 */ }
void rec_tftCsHigh(void* v)     { auto* c = static_cast<RecoveryCtx*>(v);
                                  pinMode(c->tftCs, OUTPUT);  digitalWrite(c->tftCs, HIGH); }
void rec_touchCsHigh(void* v)   { auto* c = static_cast<RecoveryCtx*>(v);
                                  pinMode(c->touchCs, OUTPUT); digitalWrite(c->touchCs, HIGH); }
void rec_closeSpi(void*)        { tft.endWrite(); }
void rec_pulseReset(void* v)    { auto* c = static_cast<RecoveryCtx*>(v);
                                  pinMode(c->tftRst, OUTPUT);
                                  digitalWrite(c->tftRst, HIGH); delay(5);
                                  digitalWrite(c->tftRst, LOW);  delay(20);
                                  digitalWrite(c->tftRst, HIGH); delay(150);
                                  g_tftResetSignalLatched = false; }
void rec_tftInit(void*)         { tft.init(); }
void rec_setRotation(void*)     { tft.setRotation(1); }
void rec_restoreTouchCal(void*) { uint16_t calData[5] = TOUCH_CALIBRATION;
                                  (void)touch_calibration::loadValid(calData);
                                  tft.setTouch(calData); }
void rec_restoreBacklight(void*){ const auto& cfg = config_store::get();
                                  display_backlight::apply(cfg.brightness); }
void rec_invalidateCaches(void*){ tft.fillScreen(0x2104); }
void rec_forceFullRedraw(void*) { screenManager.forceFullRedraw(); }
display::RecoveryResult rec_verify(void* v)  { auto* c = static_cast<RecoveryCtx*>(v);
                                  const display::StatusRead st = readTftStatus();
                                  c->status_invalid = (st == display::StatusRead::INVALID);
                                  c->observable = display::whiteScreenObservable(
                                      st != display::StatusRead::UNSUPPORTED,
                                      /*reset_latch_available=*/false);
                                  // Tristate (audit P2.3): a reliable INVALID is a
                                  // real FAILED; a genuine VALID readback is VERIFIED;
                                  // with no readback support we CANNOT claim success,
                                  // so the honest result is UNVERIFIED (never a
                                  // fabricated "pantalla blanca confirmada").
                                  if (st == display::StatusRead::INVALID)
                                      return display::RecoveryResult::FAILED;
                                  if (st == display::StatusRead::VALID)
                                      return display::RecoveryResult::VERIFIED;
                                  return display::RecoveryResult::UNVERIFIED_READBACK_UNSUPPORTED; }
void rec_resumeRenderTouch(void*) { /* control returns to render loop */ }
}  // namespace

// Runs the choreography and returns the tristate verification result plus the
// measured duration.  It does NOT draw the banner directly (audit P2.4): the
// banner is assembled on Core 1 with the real supervisor counters and shown as
// a ScreenManager overlay so the next full redraw cannot erase it.
static display::RecoveryResult executeDisplayRecovery(display::RecoveryTrigger trigger,
                                                      uint32_t& duration_ms_out,
                                                      uint8_t&  attempts_out) {
    const uint32_t t0 = millis();
    Serial.printf("[DISPLAY][RECOVERY] start — trigger: %s\n",
                  display::recoveryTriggerText(trigger));

    RecoveryCtx ctx;
#if defined(TFT_CS)
    ctx.tftCs = TFT_CS;
#endif
#if defined(TOUCH_CS)
    ctx.touchCs = TOUCH_CS;
#endif
#if defined(TFT_RST)
    ctx.tftRst = TFT_RST;
#endif

    display::RecoveryOps ops{};
    ops.stopRenderTouch   = rec_stopRenderTouch;
    ops.blockBus          = rec_blockBus;
    ops.tftCsHigh         = rec_tftCsHigh;
    ops.touchCsHigh       = rec_touchCsHigh;
    ops.closeSpi          = rec_closeSpi;
    ops.pulseReset        = rec_pulseReset;
    ops.tftInit           = rec_tftInit;
    ops.setRotation       = rec_setRotation;
    ops.restoreTouchCal   = rec_restoreTouchCal;
    ops.restoreBacklight  = rec_restoreBacklight;
    ops.invalidateCaches  = rec_invalidateCaches;
    ops.forceFullRedraw   = rec_forceFullRedraw;
    ops.verify            = rec_verify;
    ops.resumeRenderTouch = rec_resumeRenderTouch;
    ops.onStep            = nullptr;

    // Up to 3 reset→init→redraw→verify cycles.  With UNSUPPORTED readback the
    // first verify() returns the terminal UNVERIFIED result (1 attempt); a
    // future reliable readback that keeps reporting INVALID drives the honest
    // "reintentos y fallo final" path.
    const display::RecoveryOutcome oc = display::runRecovery(ops, &ctx, /*maxAttempts=*/3);

