florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    duration_ms_out = millis() - t0;
    attempts_out    = oc.attempts;
    Serial.printf("[DISPLAY][RECOVERY] done — %s | resultado=%s | intentos=%u | %lu ms\n",
                  ctx.observable ? "observable" : "no observable",
                  display::recoveryResultText(oc.result),
                  (unsigned)oc.attempts,
                  (unsigned long)duration_ms_out);

    return oc.result;
}

// ---------------------------------------------------------------------------
// renderTask() — FreeRTOS task pinned to Core 0
//
// Handles all TFT display and touch operations, keeping the main loop()
// on Core 1 free for CAN, sensors, audio, and LEDs without SPI blocking.
// The TFT SPI bus (~28 ms per frame) no longer stalls CAN polling or
// safety-critical processing.
//
// FRAME LATCH ARCHITECTURE (deterministic render):
//   1. Acquire mutex → copy renderVD into localVD (frozen snapshot)
//   2. Pass localVD to screenManager.update(localVD):
//      a. screen.update(localVD) copies data into cur_* members
//      b. frameLimiter gates screen.draw() to 20 FPS
//      c. screen.draw() reads only from cur_*/prev_* — NOT from localVD
//   3. Result: each rendered frame represents a single, consistent time instant
//      Even if CAN updates arrive mid-render, the displayed frame is atomic.
// ---------------------------------------------------------------------------
static void renderTask(void* /*param*/) {
    vehicle::VehicleData localVD;

    // First-boot policy: if the touch-calibration wizard has never been
    // completed on this device, launch it once on the very first render
    // tick.  After SAVE the `first_done` NVS flag prevents this from
    // firing again — the wizard is reachable only via the engineering
    // menu thereafter.  The check is cheap (single NVS read) and runs
    // exactly once per boot.
    bool firstBootCheckPending = !touch_calibration::firstBootDone();

    for (;;) {
        // 0. Core-1 recovery request check (audit P2 §4).  Runs BEFORE any
        // rendering so the choreography owns the SPI bus exclusively this
        // iteration.  Only Core 0 ever touches the TFT, so taking the request
        // here guarantees no interleaved transaction.
        {
            display::RecoveryTrigger trig = display::RecoveryTrigger::NONE;
            bool have = false;
            const uint32_t tnow = millis();
            taskENTER_CRITICAL(&g_recoveryMux);
            have = g_recoveryMailbox.take(trig, tnow);
            taskEXIT_CRITICAL(&g_recoveryMux);
            if (have) {
                uint32_t dur = 0; uint8_t attempts = 0;
                const display::RecoveryResult res =
                    executeDisplayRecovery(trig, dur, attempts);
                taskENTER_CRITICAL(&g_recoveryMux);
                g_recoveryMailbox.done(res, dur);
                taskEXIT_CRITICAL(&g_recoveryMux);
                // Publish a fresh heartbeat so the supervisor sees the render
                // path alive again immediately after recovery.
                renderFrameCounter = renderFrameCounter + 1;
                renderHeartbeatMs  = millis();
                vTaskDelay(1);
                continue;
            }
        }

        // 0b. Consume a post-recovery banner posted by Core 1 (audit P2.4) and
        // show it as a ScreenManager overlay (redrawn on top of every frame for
        // ~9 s, surviving the recovery's full redraw).  Only Core 0 touches the
        // TFT, so drawing here is safe.
        {
            char banner[320];
            if (takeRecoveryBanner(banner, sizeof(banner))) {
                screenManager.showRecoveryBanner(banner, millis());
            }
        }

        // 0c. Surface a persisted render-blocked reboot on the HMI (audit P2
        // final).  setup() latched the persisted cause here (Core 1) before
        // this task existed; publish it once as a ScreenManager overlay now
        // that the render path/ScreenManager are alive, then clear ONLY
        // rb_pending (keeping rb_count as the historical counter) so later
        // normal boots do not repeat the banner.
        if (s_rebootBannerPending) {
            char banner[320];
            display::formatRebootRecoveryBanner(banner, sizeof(banner),
                                                s_rebootBannerInfo);
            screenManager.showRecoveryBanner(banner, millis());
            s_rebootBannerPending = false;
            clearRenderBlockedPending();
        }

        // 1. Copy latest vehicle data from main loop
        if (xSemaphoreTake(vdMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            localVD = renderVD;
            xSemaphoreGive(vdMutex);
        }

        // First-boot wizard trigger (executed at most once per boot, on
        // the first iteration after the screen manager is alive).  The
        // engineering-menu "TOUCH CALIBRATION" entry is handled atomically
        // inside ScreenManager::update() (right after engineering exit)
        // so we don't need to poll for it here.
        if (firstBootCheckPending) {
            firstBootCheckPending = false;
            screenManager.requestTouchWizard(/*firstBoot=*/true);
        }

        // 2. Update & render screen (frame limiter inside screenManager)
        lastFrameStart = millis();
        screenManager.update(localVD);

        // 3. Runtime overlay on boot screen only
        {
            uint32_t frameTime = millis() - lastFrameStart;
            if (showOverlay && screenManager.isInitialScreen()) {
                draw_runtime_overlay(tft, frameTime);
            } else {
                showOverlay = false;
            }
        }

        // 4. Centralized touch handling (same SPI bus as TFT)
        {
            uint16_t tx = 0, ty = 0;
            bool isTouched = tft.getTouch(&tx, &ty);
            touch::update(isTouched, static_cast<int16_t>(tx),
                          static_cast<int16_t>(ty));

            touch::TouchEvent evt = touch::getEvent();

