florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Initialize WS2812B LED controller (front GPIO 47 + rear GPIO 48)
    led_ctrl::init();

    // Initialize power manager (ignition key on GPIO 40/41)
    power_mgr::init();

    // Initialize DFPlayer audio (UART2 on GPIO 43/44)
    audio::init();

    // Initialize MCP23017 shifter input (I2C on GPIO 8/9)
    shifter::init();

    // Initialize remote control parser (FlySky FS-iA6B iBUS, GPIO 16 RX).
    // Enabled by default (REMOTE_CONTROL_ENABLED=1 in platformio.ini);
    // compiles to an inline no-op when the flag is set to 0.  See
    // docs/REMOTE_CONTROL_IMPLEMENTATION_PLAN.md Phase 2.
    remote_control::init();

    // Initialize traction switch (DPDT rocker on GPIO 15)
    traction_sw::init();

    // Initialize centralized touch handler
    touch::init();

    // Apply saved configuration
    {
        const auto& cfg = config_store::get();
        frontLedLocalState = cfg.frontLedEnabled;
        rearLedLocalState  = cfg.rearLedEnabled;

        // Apply saved audio volume to DFPlayer
        audio::setVolume(cfg.audioVolume);
        lastAppliedAudioVolume = cfg.audioVolume;

        // Restore saved LED decorative mode
        led_ctrl::setDecorMode(static_cast<led_ctrl::DecorMode>(cfg.ledMode));

        // §1/§2: DESIRED = driver intent from the physical selector position +
        // the saved tank-turn toggle.  APPLIED stays UNKNOWN (0) until the STM32
        // heartbeat confirms a real mode, so the HMI icon can never claim 4x4
        // before the STM32 actually applied it.
        localTankTurn    = (cfg.driveMode & can::MODE_FLAG_TANK_TURN) != 0;
        desiredModeFlags = mode_authority::arbitrate(
            /*remoteActive=*/false, /*remoteModeFlags=*/0,
            traction_sw::is4WD(), localTankTurn);
        appliedModeFlags = 0;
        traction_sw::clearChanged();  // ignore the init-time "changed" latch

        // Populate vehicleData with the APPLIED (confirmed) mode — 0 at boot.
        vehicle::ModeData md;
        md.modeFlags   = appliedModeFlags;
        md.timestampMs = millis();
        vehicleData.setMode(md);

        // Seed the drive-mode sync FSM with the PHYSICAL selector position
        // read at boot (§B).  This makes the desired mode explicit from the
        // real GPIO15 position immediately — the FSM starts with
        // confirmedValid_=false, so the selected mode (even 4x2) is
        // transmitted and kept pending until the STM32 really confirms it,
        // instead of assuming a 4x2 default.
        g_modeSync.setDesired(desiredModeFlags);
    }

    // Create render task on Core 0 — offloads all TFT and touch operations
    // from the main loop, preventing SPI blocking on Core 1.
    vdMutex = xSemaphoreCreateMutex();
    touchActionQueue = xQueueCreate(8, sizeof(TouchAction));
    if (vdMutex == nullptr || touchActionQueue == nullptr) {
        Serial.println("[BOOT][ERR] Failed to create render task resources");
        // Fall through — render task won't be created, TFT won't update.
        // System is still safe (CAN, safety, LEDs continue on Core 1).
    } else {
        BaseType_t rc = xTaskCreatePinnedToCore(
            renderTask, "Render", 16384, nullptr, 1, &renderTaskHandle, 0);
        if (rc != pdPASS) {
            Serial.println("[BOOT][ERR] Failed to create render task");
        } else {
            Serial.println("[BOOT][INFO] Render task started on Core 0");
        }
    }

    // Boot-diagnostics telemetry — single machine-parseable line emitted once
    // per boot on the serial channel (the ESP32 HMI is CAN receive-only, so it
    // has no diagnostic-frame TX path).  Captures the reset cause plus the heap
    // low-water mark and both task stack high-watermarks so brownouts, panics,
    // watchdog resets, heap exhaustion and stack pressure are all observable
    // from the boot log.  Formatting/classification lives in the host-tested
    // boot_diag module; this is pure instrumentation.
    {
        boot_diag::HeapStats hs;
        hs.freeNow      = (uint32_t)esp_get_free_heap_size();
        hs.minFreeEver  = (uint32_t)esp_get_minimum_free_heap_size();
        hs.totalSize    = (uint32_t)ESP.getHeapSize();
        hs.largestBlock = (uint32_t)ESP.getMaxAllocHeap();
        uint32_t loopHwm   = (uint32_t)uxTaskGetStackHighWaterMark(nullptr);
        uint32_t renderHwm = (renderTaskHandle != nullptr)
                           ? (uint32_t)uxTaskGetStackHighWaterMark(renderTaskHandle)
                           : 0u;
        char bootLine[192];
        boot_diag::format(bootLine, sizeof(bootLine), bootRc, hs, loopHwm, renderHwm);
        Serial.println(bootLine);
    }
}

// ---------------------------------------------------------------------------
// loop() — called repeatedly
// ---------------------------------------------------------------------------
void loop() {
    RTMON_LOOP_BEGIN();
    unsigned long now = millis();

    // R-3 hardening: emit stack high-watermark for both FreeRTOS tasks
    // every 5 s.  Pure instrumentation — uxTaskGetStackHighWaterMark
    // is non-blocking and reports the minimum free stack (in words on
    // ESP-IDF FreeRTOS) seen since task creation.  No stack sizes are
    // changed; this only makes silent overflow risk observable.
    {
        static uint32_t s_lastStackHwmLogMs = 0;
        if ((now - s_lastStackHwmLogMs) >= 5000UL) {
            s_lastStackHwmLogMs = now;
            UBaseType_t loopHwm   = uxTaskGetStackHighWaterMark(nullptr);
            UBaseType_t renderHwm = (renderTaskHandle != nullptr)
                                  ? uxTaskGetStackHighWaterMark(renderTaskHandle)
                                  : 0;
            Serial.printf("[STACK] loop_hwm=%u render_hwm=%u\n",
                          (unsigned)loopHwm, (unsigned)renderHwm);
        }
    }

    // ---- Bench/manual TFT recovery request (audit P2 §4.2) ----
    // The white screen is NOT automatically observable with the current wiring
    // (no reliable readback, no reset-signal latch), so an operator on the
    // bench can explicitly request a recovery by sending 'R' (or 'r') over the
    // USB serial console.  This sets a flag consumed by the supervisor block
    // below, which forces a confirmed loss and drives the Core-0 choreography.
    while (Serial.available() > 0) {
        int c = Serial.read();
        if (c == 'R' || c == 'r') {
            g_manualRecoveryRequest = true;
            Serial.println("[DISPLAY][RECOVERY] manual/bench request received");
        }
    }

