florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // ---- Display supervisor + recovery orchestration (audit P2) ----
    // Core-1 does DETECTION only and, when a recovery is warranted, REQUESTS it
    // from the Core-0 render task (which owns the SPI bus).  Core 1 NEVER calls
    // TFT_eSPI.  Readback is reported as UNSUPPORTED here because the ST7796
    // panel cannot be read back reliably with the current wiring, so a stalled
    // render heartbeat is honestly classified as RENDER_STALLED (an observable
    // fact) — never asserted as "pantalla blanca confirmada".  A bench/manual
    // request (g_manualRecoveryRequest) exists precisely because the white
    // screen is NOT automatically observable with this hardware.
    {
        static display::Supervisor s_dispSup;
        static uint32_t s_lastDispEvalMs = 0;
        static display::State s_lastDispState = display::State::OK;
        static bool s_recoveryPosted = false;
        static display::RecoveryTrigger s_lastTrigger = display::RecoveryTrigger::NONE;
        const uint32_t kRenderStaleMs = 500;  // mirrors Config::render_stale_ms
        // Bounded wait for the render task to consume+finish a recovery request
        // before we treat it as genuinely blocked (audit P2.1).
        const uint32_t kRenderBlockedMs = 3000;

        // First, finalise any recovery the render task has already completed so
        // the supervisor's counters / backoff stay consistent.
        {
            display::RecoveryResult res = display::RecoveryResult::FAILED;
            uint32_t dur = 0;
            bool haveResult;
            taskENTER_CRITICAL(&g_recoveryMux);
            haveResult = g_recoveryMailbox.takeResult(res, dur);
            taskEXIT_CRITICAL(&g_recoveryMux);
            if (haveResult) {
                // VERIFIED and UNVERIFIED both map to a non-failed completion:
                // the choreography ran; only a reliable INVALID readback is a
                // real FAILED (audit P2.3 tristate).
                const bool ok = (res != display::RecoveryResult::FAILED);
                const uint8_t attemptsDone = s_dispSup.attempts();
                // Walk the pure FSM through its hardware stages, then complete.
                s_dispSup.advanceRecovery((uint32_t)now);   // -> RESETTING
                s_dispSup.advanceRecovery((uint32_t)now);   // -> REINITIALIZING
                s_dispSup.advanceRecovery((uint32_t)now);   // -> REDRAWING
                s_dispSup.completeRecovery((uint32_t)now, ok);
                s_recoveryPosted = false;

                // Assemble the banner with the REAL supervisor counters (audit
                // P2.4/P2.5 — no hardcoded total_recoveries / render_continued)
                // and post it to Core 0 to be shown as a managed overlay.
                display::RecoveryBannerInfo info{};
                info.cause            = display::recoveryTriggerToFault(s_lastTrigger);
                info.trigger          = s_lastTrigger;
                info.duration_ms      = dur;
                info.attempts         = attemptsDone;
                info.verify_result    = res;
                info.render_continued = true;   // render consumed+finished (no reboot)
                info.esp32_rebooted   = false;
                info.free_heap        = (uint32_t)ESP.getFreeHeap();
                info.total_recoveries = s_dispSup.recoveryCount();
                char banner[320];
                display::formatRecoveryBanner(banner, sizeof(banner), info);
                postRecoveryBanner(banner);

                Serial.printf("[DISPLAY][RECOVERY] finalised — %s (%lu ms) | "
                              "estado=%s recuperaciones=%lu fallidas=%lu\n",
                              display::recoveryResultText(res), (unsigned long)dur,
                              display::stateText(s_dispSup.state()),
                              (unsigned long)s_dispSup.recoveryCount(),
                              (unsigned long)s_dispSup.recoveryFailCount());
            }
        }

        // Audit P2.1 — if a recovery was posted but the render task never
        // consumed/finished it within the bounded window, the render path is
        // genuinely blocked.  Persist the cause and perform a controlled ESP32
        // restart as a last resort.  Core 1 must NOT touch the TFT/SPI here.
        if (s_recoveryPosted) {
            bool stalled;
            taskENTER_CRITICAL(&g_recoveryMux);
            stalled = g_recoveryMailbox.renderStalled((uint32_t)now, kRenderBlockedMs);
            taskEXIT_CRITICAL(&g_recoveryMux);
            if (stalled) {
                persistRenderBlockedAndReboot(s_lastTrigger);  // does not return
            }
        }

        if ((now - s_lastDispEvalMs) >= 100UL) {
            s_lastDispEvalMs = now;

            const bool manual = g_manualRecoveryRequest;
            const bool reset_latched = g_tftResetSignalLatched;

            // A manual/bench request forces a confirmed loss so the FSM opens a
            // recovery attempt (the white screen is otherwise not observable).
            if (manual && !s_dispSup.recovering() &&
                s_dispSup.state() != display::State::RECOVERY_FAILED) {
                s_dispSup.forceFault(
                    (uint32_t)now,
                    display::recoveryTriggerToFault(
                        display::RecoveryTrigger::RECOVERY_MANUAL_REQUEST));
            }
            g_manualRecoveryRequest = false;

            display::State st = s_dispSup.update(
                (uint32_t)now,
                (uint32_t)renderHeartbeatMs,
                display::StatusRead::UNSUPPORTED,
                (uint32_t)ESP.getFreeHeap());

            // When the FSM asks for a recovery, classify the trigger honestly
            // and post the request to Core 0 (once per attempt).
            if (st == display::State::RECOVERY_REQUESTED && !s_recoveryPosted) {
                const bool render_stale =
                    (uint32_t)(now - renderHeartbeatMs) >= kRenderStaleMs;
                display::RecoveryTrigger trig = display::classifyRecoveryTrigger(
                    manual, reset_latched,
                    display::StatusRead::UNSUPPORTED, render_stale);
                if (requestDisplayRecovery(trig)) {
                    s_recoveryPosted = true;
                    s_lastTrigger    = trig;
                    Serial.printf("[DISPLAY][RECOVERY] requested from Core 1 — "
                                  "trigger: %s | observable=%s\n",
                                  display::recoveryTriggerText(trig),
                                  display::whiteScreenObservable(false, reset_latched)
                                      ? "si" : "no");
                }
            }

            if (st != s_lastDispState) {
                if (st == display::State::CONFIRMED_LOST) {
                    display::Fault f = s_dispSup.lastFault();
                    display::RecoveryBannerInfo info{};
                    info.cause            = f;
                    info.duration_ms      = 0;
                    info.attempts         = s_dispSup.attempts();
                    info.render_continued = false;
                    info.esp32_rebooted   = false;
                    info.free_heap        = (uint32_t)ESP.getFreeHeap();
                    info.total_recoveries = s_dispSup.recoveryCount();
                    Serial.printf("[DISPLAY] fault suspected: %s | %s\n",
                                  display::faultText(f),
                                  display::recoveryActionText(info));
                } else if (st == display::State::RECOVERY_FAILED) {
                    Serial.printf("[DISPLAY][RECOVERY] FAILED after %u attempts — "
                                  "manual intervention required\n",
                                  (unsigned)s_dispSup.attempts());
                }
                s_lastDispState = st;
            }
        }
    }

    // Poll CAN RX and decode incoming frames
    RTMON_CAN_BEGIN();
    can_rx::poll(vehicleData);
    RTMON_CAN_END();

    // Check for pending ACK (non-blocking)
    ackCheck(vehicleData);

    // ---- Sync APPLIED mode flags from STM32 heartbeat echo ----
    // The STM32 echoes the active mode flags in the heartbeat status_flags
    // (bits 1-2).  This is the SOLE writer of appliedModeFlags — the heartbeat
    // is the only authority for the CONFIRMED (applied) mode.  The desired mode
    // (selector/remote/tank) is NEVER written here, so an applied value can
    // never overwrite the driver's intent.
    // §1 CAN state validation: this is the SOLE source of truth for the UI mode
    // icon.  Tank turn and traction toggles only change desiredModeFlags — the
    // UI updates here after the STM32 confirms via heartbeat echo.
    // Guard: only sync after first valid heartbeat has been received
    // (timestampMs is 0 until the first CAN heartbeat is decoded).
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            uint8_t confirmedFlags = (hb.statusFlags >> 1) & 0x03;
            if (confirmedFlags != appliedModeFlags) {
                appliedModeFlags = confirmedFlags;
                vehicle::ModeData md;
                md.modeFlags   = appliedModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
                // Persist confirmed tank turn state to NVS
                config_store::setDriveMode(appliedModeFlags & can::MODE_FLAG_TANK_TURN);
            }
        }
    }

