florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
    // Verify the STM32 alive counter is incrementing each heartbeat period.
    // A frozen STM32 (timer ISR alive but main loop stuck) would send the same
    // counter value indefinitely — treat it as non-responsive after the freeze
    // threshold and inhibit further motion commands from this node.
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            // Evaluate the alive counter only when a NEW heartbeat frame has
            // been decoded (tracked via hb.timestampMs).  This prevents the
            // same sample from being counted repeatedly while loop() spins far
            // faster than the ~100 ms heartbeat period (root cause of the
            // FALSE "STM32 frozen" detection).  A time-based absence timeout
            // covers the "no new heartbeat at all" case.
            stm32Liveness.update((uint32_t)hb.timestampMs, hb.aliveCounter, (uint32_t)now);
            stm32IsAlive = stm32Liveness.isAlive();
            if (stm32Liveness.consumeFrozenEdge() &&
                (now - stm32FrozenWarnLastMs) >= STM32_FROZEN_WARN_INTERVAL_MS) {
                stm32FrozenWarnLastMs = now;
                Serial.println("[SAFETY][WARN] STM32 heartbeat counter frozen — inhibiting commands");
            }

            // ---- Gear re-sync after STM32 restart (SAFETY FIX) ----
            // Detect startup_inhibit bit (statusFlags bit 0): 0→1 = STM32 just restarted.
            // When the bit later clears (0) AND state is ACTIVE, re-send the current gear
            // so the STM32 and shifter are synchronised.  Guards against the default
            // GEAR_FORWARD mis-match if the driver had previously selected PARK or REVERSE.
            bool startupInhibitNow = (hb.statusFlags & 0x01u) != 0;
            if (startupInhibitNow && !stm32StartupSeen) {
                // Rising edge of startup_inhibit → STM32 just booted/reset
                stm32StartupSeen    = true;
                gearResyncPending   = true;
                tempMapResyncPending = true;
                // The STM32 restarted → whatever drive mode it last confirmed
                // is stale.  Invalidate the ModeSync confirmation so the
                // physical selector's mode is RE-TRANSMITTED even if it equals
                // the previously-confirmed value (root cause of a confirmed
                // 4x4 never being resent after an STM32 restart).
                g_modeSync.invalidateConfirmed();
                Serial.println("[SAFETY][INFO] STM32 restart detected — gear + temp-map resync pending");
            }
            if (gearResyncPending && !startupInhibitNow &&
                hb.systemState == can::SystemState::ACTIVE && stm32IsAlive) {
                // STM32 is now in ACTIVE with no startup inhibit — send current gear
                uint8_t curGear = shifter::getGearRaw();
                sendGearCommand(curGear);
                lastSentGear    = curGear;  // prevent duplicate send from shifter loop
                gearResyncPending = false;
                Serial.printf("[SAFETY][INFO] Gear resync sent: gear=%u\n", curGear);
            }
            // Re-send the DS18B20 physIdx→role mapping after STM32 restart so
            // the STM32's in-RAM map matches the user's saved assignment.
            // Sent in STANDBY or ACTIVE (STM32 can receive it in either state).
            if (tempMapResyncPending && !startupInhibitNow && stm32IsAlive) {
                const auto& cfg = config_store::get();
                CanFrame frame = {};
                frame.identifier       = can::CMD_SENSOR_MAP_TEMP;
                frame.extd             = 0;
                frame.data_length_code = config_store::NUM_TEMP_SENS;
                for (uint8_t i = 0; i < config_store::NUM_TEMP_SENS; ++i) {
                    frame.data[i] = cfg.tempSensorMap[i];
                }
                ESP32Can.writeFrame(frame, 0);
                tempMapResyncPending = false;
                Serial.println("[SAFETY][INFO] DS18B20 sensor map resync sent to STM32");
            }
            if (!startupInhibitNow) {
                stm32StartupSeen = false;  // inhibit cleared, ready for next detection
            }

            // ---- Drive-mode confirmation from the heartbeat echo ----
            // The STM32 heartbeat echoes its applied drive mode (statusFlags
            // bit1 = 4x4, bit2 = tank turn).  Feed it into ModeSync as remote
            // confirmation so a selected mode still confirms even when the
            // CMD_ACK for our CMD_MODE was lost, and so a silent STM32 mode
            // revert is re-synchronised.  Processed once per NEW heartbeat
            // frame (tracked via hb.timestampMs) and only while the link is
            // proven alive.  Map STM32 statusFlags bits → CMD_MODE flag bits.
            if (stm32IsAlive &&
                (uint32_t)hb.timestampMs != (uint32_t)g_lastModeEchoTs) {
                g_lastModeEchoTs = (unsigned long)hb.timestampMs;
                uint8_t echoFlags = 0;
                if (hb.statusFlags & 0x02u) echoFlags |= can::MODE_FLAG_4X4;
                if (hb.statusFlags & 0x04u) echoFlags |= can::MODE_FLAG_TANK_TURN;
                g_modeSync.onHeartbeatModeEcho(echoFlags);
            }

            // ---- One-shot LED relay restore from NVS after boot ----
            // If the front/rear LED strips were saved as ENABLED, power them
            // up automatically once the STM32 is alive and out of BOOT — the
            // user should NOT have to press the button after boot.  An explicit
            // OFF state (both false) is respected: nothing is sent.  Only the
            // LED relays are touched (CMD_LED); traction/steering relays are
            // never affected here.  Retries (rate-limited, bounded) until the
            // STM32 echoes the desired relay state so a dropped CAN frame can't
            // silently leave the strips off.
            if (!ledBootRestoreDone && stm32IsAlive &&
                (hb.systemState == can::SystemState::STANDBY ||
                 hb.systemState == can::SystemState::ACTIVE)) {
                if (!frontLedLocalState && !rearLedLocalState) {
                    ledBootRestoreDone = true;  // OFF saved — respect it, nothing to do
                } else if (vehicleData.lights().frontRelayOn == frontLedLocalState &&
                           vehicleData.lights().rearRelayOn  == rearLedLocalState) {
                    ledBootRestoreDone = true;  // STM32 already reflects saved state
                } else if (ledBootRestoreAttempts >= LED_BOOT_RESTORE_MAX_ATTEMPTS) {
                    ledBootRestoreDone = true;  // give up after bounded retries
                } else if ((now - ledBootRestoreLastMs) >= LED_BOOT_RESTORE_RETRY_MS) {
                    sendLedCommand(frontLedLocalState, rearLedLocalState);
                    ledBootRestoreLastMs = now;
                    ledBootRestoreAttempts++;
                    Serial.printf("[LED] Boot restore from NVS (try %u) → front=%s rear=%s\n",
                                  ledBootRestoreAttempts,
                                  frontLedLocalState ? "ON" : "OFF",
                                  rearLedLocalState ? "ON" : "OFF");
                }
            }
        }
    }

    // Update obstacle sensor and transmit CAN 0x208
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t speedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            speedSum += vehicleData.speed().raw[i];
        }
        float speedKmh = static_cast<float>(speedSum) / 4.0f * 0.1f;
        obstacle_sensor::update(speedKmh);
        can_obstacle::update();

        // Update VehicleData with latest sensor reading for HMI display.
        // distanceCm = 0 maps to "---" in the UI, signalling no valid reading.
        // Use 0 when the sensor is unhealthy (fault/stuck/timeout) so the
        // display shows "---" instead of a misleading "0.02 m" fallback value.
        obstacle_sensor::Reading rd = obstacle_sensor::getReading();
        vehicle::ObstacleData od;
        od.distanceCm  = rd.healthy ? (rd.distance_mm / 10) : 0;
        od.timestampMs  = millis();
        vehicleData.setObstacle(od);
    }

    // ---- Update shared vehicle data for render task (Core 0) ----
    // Non-blocking: skip if render task holds the mutex (stale-by-one-frame is OK).
    if (vdMutex != nullptr && xSemaphoreTake(vdMutex, 0) == pdTRUE) {
        renderVD = vehicleData;
        xSemaphoreGive(vdMutex);
    }

