florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Poll iBUS parser (no-op only when REMOTE_CONTROL_ENABLED=0) and compute
    // unified LOCAL/REMOTE arbitration gates for all RC-driven subsystems.
    remote_control::update();
    const bool remoteAuthorityActive =
        stm32IsAlive &&
        remote_control::isRemoteSelected() &&
        remote_control::getState() == remote_control::State::ACTIVE;
    const bool remoteMotionAuthorityActive =
        remoteAuthorityActive && !remote_control::isKillSwitchActive();

    // ---- Shifter gear update ----
    // Poll shifter + RC CH7 and send CAN 0x102 on authoritative source change.
    {
        shifter::update();
        uint8_t gear = remoteMotionAuthorityActive
                     ? remote_control::getRequestedGear()
                     : shifter::getGearRaw();
        if (gear != lastSentGear &&
            (now - lastGearSendMs) >= GEAR_SEND_DEBOUNCE_MS &&
            stm32IsAlive) {
            lastSentGear   = gear;
            lastGearSendMs = now;
            sendGearCommand(gear);
            // Play specific gear announcement
            switch (static_cast<shifter::Gear>(gear)) {
                case shifter::Gear::PARK:       audio::play(audio::Sound::GEAR_PARK,    audio::Priority::LO); break;
                case shifter::Gear::REVERSE:    audio::play(audio::Sound::GEAR_REVERSE, audio::Priority::LO); break;
                case shifter::Gear::NEUTRAL:    audio::play(audio::Sound::GEAR_NEUTRAL, audio::Priority::LO); break;
                case shifter::Gear::FORWARD:    audio::play(audio::Sound::GEAR_D1,      audio::Priority::LO); break;
                case shifter::Gear::FORWARD_D2: audio::play(audio::Sound::GEAR_D2,      audio::Priority::LO); break;
            }
            Serial.printf(remoteMotionAuthorityActive // flawfinder: ignore
                              ? "[REMOTE] Gear(CH7) → %u\n"
                              : "[SHIFTER] Gear → %u\n",
                          gear);
        }
    }

    // ---- Traction switch update ----
    // Poll DPDT rocker switch for 2WD/4WD selection.
    // CAN CMD_MODE is sent only when the switch state changes.
    // Speed gate is handled internally by traction_sw::update().
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t swSpeedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            swSpeedSum += vehicleData.speed().raw[i];
        }
        float swSpeedKmh = static_cast<float>(swSpeedSum) / 4.0f * 0.1f;

        traction_sw::update(swSpeedKmh);

        // ---- §2 Single desired-mode arbitration → ModeSync ----------------
        // Selector, remote and tank-turn all converge here.  arbitrate() picks
        // the authoritative source (REMOTE when it holds motion authority, else
        // the LOCAL selector 4x4 bit + local tank-turn toggle).  A LOCAL↔REMOTE
        // switch simply re-evaluates this, so the desired mode is recomputed and
        // ModeSync resynchronises automatically.  setDesired() re-arms the FSM
        // only on a genuine change, so calling it every tick is cheap.  There is
        // NO direct sendModeCommand() from the selector, remote or tank paths —
        // the FSM below is the single CMD_MODE (mode-change) owner.
        {
            // LOCAL selector edge → audio + log feedback only (no CAN here).
            if (!remoteMotionAuthorityActive) {
                if (traction_sw::hasChanged()) {
                    if (traction_sw::is4WD()) {
                        audio::play(audio::Sound::TRACTION_4X4, audio::Priority::LO);
                    } else {
                        audio::play(audio::Sound::TRACTION_4X2, audio::Priority::LO);
                    }
                    Serial.printf("[TRACTION] Switch → %s\n",
                                  traction_sw::is4WD() ? "4WD" : "2WD");
                    traction_sw::clearChanged();
                }
            } else {
                // Under remote authority the physical selector is ignored; drop
                // any latched edge so it does not fire stale audio on return.
                traction_sw::clearChanged();
            }

            desiredModeFlags = mode_authority::arbitrate(
                remoteMotionAuthorityActive,
                remote_control::getDriveMode(),
                traction_sw::is4WD(),
                localTankTurn);
            g_modeSync.setDesired(desiredModeFlags);
        }

        // ---- Drive-mode sync FSM tick (SINGLE CMD_MODE owner) --------------
        // Runs in BOTH authorities so the remote and the local selector share
        // one ModeSync (the desired source was arbitrated above).  Feeds
        // observed CMD_MODE ACKs into the FSM, then advances it: the FSM
        // (re)transmits the desired mode until the STM32 confirms it (ACK or
        // heartbeat echo), retrying a lost frame a bounded number of times and
        // keeping a TEMPORARY block (REJECTED / BLOCKED_BY_SAFETY) pending
        // without flooding the bus.
        {
            const auto& ad = vehicleData.ack();
            if (g_modeSync.pending()
                && ad.cmdIdLow == (can::CMD_MODE & 0xFF)
                && ModeSync::ackIsAtOrAfterSend((uint32_t)ad.timestampMs,
                                                (uint32_t)g_modeSendMs)
                && ad.timestampMs != g_lastModeAckTs) {
                g_lastModeAckTs = ad.timestampMs;
                // Map the four CAN-level CMD_ACK codes to ModeSync semantics.
                // Only INVALID is a hard failure; REJECTED (speed/condition)
                // and BLOCKED_BY_SAFETY (STM32 still in BOOT/STANDBY) are
                // TEMPORARY — the request is kept pending and retried until the
                // STM32 accepts it, so a mode selected before the vehicle is
                // ACTIVE applies automatically without moving the selector.
                ModeSync::AckResult msRes;
                switch (ad.result) {
                    case can::AckResult::OK:
                        msRes = ModeSync::AckResult::OK; break;
                    case can::AckResult::INVALID:
                        msRes = ModeSync::AckResult::INVALID; break;
                    case can::AckResult::BLOCKED_BY_SAFETY:
                        msRes = ModeSync::AckResult::BLOCKED; break;
                    case can::AckResult::REJECTED:
                    default:
                        msRes = ModeSync::AckResult::REJECTED; break;
                }
                g_modeSync.onAck(msRes);
                // [MODESYNC] diagnostic (§4) — last ACK + requested/confirmed,
                // retry count, block counter, block cause and request age so a
                // stuck temporary block is always visible in the log.
                Serial.printf(
                    "[MODESYNC] ack=%u req=0x%02X app=0x%02X conf=0x%02X "
                    "retries=%u blocks=%u ageMs=%lu%s%s\n",
                    (unsigned)ad.result,
                    g_modeSync.desired(), appliedModeFlags, g_modeSync.confirmed(),
                    (unsigned)g_modeSync.retries(),
                    (unsigned)g_modeSync.blockCount(),
                    (unsigned long)g_modeSync.requestAgeMs(millis()),
                    g_modeSync.blocked() ? " (blocked/retry)" : "",
                    g_modeSync.failed() ? " -> FAILED" : "");
            }
            if (g_modeSync.update(millis(), stm32IsAlive)
                    == ModeSync::Action::SEND) {
                g_modeSendMs = millis();
                sendModeCommand(g_modeSync.sendMode());
                // [MODESYNC] diagnostic — each (re)transmission attempt.
                Serial.printf(
                    "[MODESYNC] send req=0x%02X app=0x%02X conf=0x%02X attempt=%u/%u\n",
                    g_modeSync.desired(), appliedModeFlags, g_modeSync.confirmed(),
                    (unsigned)g_modeSync.retries() + 1u,
                    (unsigned)MODE_SYNC_MAX_RETRIES + 1u);
            }
        }
    }

    // ---- Process touch actions from render task (Core 0) ----
    // Touch reading and screen dispatch happen on Core 0 (same SPI bus as TFT).
    // Actions that require CAN sends or state changes are queued here.
    if (touchActionQueue != nullptr) {
        TouchAction act;
        while (xQueueReceive(touchActionQueue, &act, 0) == pdTRUE) {
            switch (act) {
                case TouchAction::FRONT_LED_TOGGLE:
                    if (remoteAuthorityActive) break;
                    frontLedLocalState = !frontLedLocalState;
                    sendLedCommand(frontLedLocalState, rearLedLocalState);
                    config_store::setFrontLedEnabled(frontLedLocalState);
                    audio::play(frontLedLocalState ? audio::Sound::LIGHTS_ON
                                                   : audio::Sound::LIGHTS_OFF,
                                audio::Priority::LO);
                    Serial.printf("[LED] Front → %s\n",
                                  frontLedLocalState ? "ON" : "OFF");
                    break;

